app/Http/Controllers/OrderController.php

select * from `orders` where user_id = 2 and created_at < curdate() order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `orders` where user_id = 2 and created_at < curdate()
---
    public function index()
    {
        $user = auth()->user();

        return $allOrders = Order::whereRaw("user_id = $user->id and created_at < curdate()")
                        ->orderBy('created_at', 'desc')
                        ->paginate(8);