app/Http/Controllers/ShopController.php

select * from `categories`
select * from `products` where `products`.`category_id` in ('1', '2') and `holiday_special` = '0'
---
    public function index()
    {
        $title = HolidayTitle::first();
        if (! $title == null) {
            $title = $title->toArray();
            $title = $title['holiday_page_title'];
        }

        $categories = Category::with(['products' => function ($query) {
            $query->where('holiday_special', false);
        }])->get();