app/Http/Controllers/UserController.php

    public function edit()
    {
        $user = Auth::user();

        $orders = Order::selectRaw('*')
                        ->whereRaw('day(created_at) = day(curdate())
                                    and year(created_at) = year(curdate())
                                    and month(created_at) = month(curdate())')
                        ->where('user_id', $user->id)
                        ->orderBy('id', 'desc')
                        ->get();
---
select * from `orders` where day(created_at) = day(curdate())
and year(created_at) = year(curdate())
and month(created_at) = month(curdate()) and `user_id` = '2' order by `id` desc