app/Providers/OptionsServiceProvider.php

    public function boot()
    {
        \View::composer('*', function ($view) {

            $title = HolidayTitle::first();
---
select * from `holiday_titles` limit 1